name: "oss_gpt_20b"
backend: "python"
max_batch_size: 1

# NOTE: Placeholder config for planning. Implement Python backend and model loader later.
input [
  { name: "PROMPT", data_type: TYPE_STRING, dims: [ -1 ] }
]
output [
  { name: "TEXT", data_type: TYPE_STRING, dims: [ -1 ] }
]

instance_group [
  { kind: KIND_CPU, count: 1 }
]
